from tests.conftest import main_runner

def test_print_stats_positive(capsys):
    args = ['main.py', '--files', 'data_in/data_in_1.csv', 'data_in/data_in_2.csv', 'data_in/data_in_3.csv', '--report', 'median-coffee']
    result_code, std_err_text, std_out_text = main_runner(args=args, capsys=capsys)
    assert result_code == 0
    assert std_out_text == \
'''+-----------------+-----------------+
| student         |   median_coffee |
+=================+=================+
| Иван Кузнецов   |             650 |
+-----------------+-----------------+
| Олег Морозов    |             575 |
+-----------------+-----------------+
| Алексей Смирнов |             510 |
+-----------------+-----------------+
| Дмитрий Фролов  |             495 |
+-----------------+-----------------+
| Кирилл Андреев  |             430 |
+-----------------+-----------------+
| Павел Новиков   |             420 |
+-----------------+-----------------+
| Елена Волкова   |             310 |
+-----------------+-----------------+
| Наталья Орлова  |             260 |
+-----------------+-----------------+
| Дарья Петрова   |             250 |
+-----------------+-----------------+
| Анна Белова     |             230 |
+-----------------+-----------------+
| Мария Соколова  |             125 |
+-----------------+-----------------+'''
